Revit 2027 API
BuiltInFailures.ElectricalFailures.FeedThroughLugsIsDisabled Property
 The feed through lugs option is unchecked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FeedThroughLugsIsDisabled { get; }
Public Shared ReadOnly Property FeedThroughLugsIsDisabled As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FeedThroughLugsIsDisabled {
	FailureDefinitionId^ get ();
}
static member FeedThroughLugsIsDisabled : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace